---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeToposolid
source: html/e8b5c3dc-be06-fd65-b4de-135798a35e93.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotMakeToposolid Property

Can't construct toposolid.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMakeToposolid { get; }
```